{
    "title": "Monkey Bread",
    "rating": 5,
    "reviews": 74,
    "comments": 57,
    "categories": [
        "Desserts or Baked Goods",
        "Breads",
        "Breakfast & Brunch"
    ],
    "source": {
        "publication": "Cook's Country",
        "date": "April/May 2005",
        "tv_season": "Season 3",
        "episode": "Breakfast Showstoppers"
    },
    "image_url": "https://mrb-recipe-images-dev.s3.amazonaws.com/default.png",
    "description": "Monkey bread is a knotty-looking loaf of bread made from buttery balls of sweet dough glued together with caramel.",
    "yield": "Serves 6 to 8",
    "ingredients": {
        "dough": [
            "2 tablespoons unsalted butter, softened",
            "1 cup warm milk (about 110 degrees)",
            "1/3 cup warm water (about 110 degrees)",
            "1/4 cup granulated sugar",
            "2 1/4 teaspoons instant or rapid-rise yeast",
            "3 1/4 cups all-purpose flour, plus extra for work surface",
            "2 teaspoons table salt",
            "2 tablespoons unsalted butter, melted"
        ],
        "sugar_coating": [
            "1 cup packed light brown sugar",
            "2 teaspoons ground cinnamon",
            "8 tablespoons unsalted butter, melted"
        ],
        "glaze": [
            "1 cup confectioners' sugar",
            "2 tablespoons milk"
        ]
    },
    "instructions": [
        "Adjust oven rack to medium-low position and heat oven to 200 degrees. When oven reaches 200 degrees, turn it off. Butter Bundt pan with softened butter. Set aside.",
        "In a large measuring cup, mix milk, water, melted butter, sugar, and yeast. Mix flour and salt in a mixer with dough hook. Slowly add milk mixture. Increase speed and mix until dough is shiny and smooth, about 6 to 7 minutes.",
        "Turn dough onto floured counter and knead briefly. Place in greased bowl, cover, and let rise in warm oven until doubled in size, 50 to 60 minutes.",
        "While dough is rising, mix brown sugar and cinnamon. Place melted butter in another bowl.",
        "Remove dough and cut into 64 pieces. Roll into balls. Dip in butter, then roll in sugar mix. Layer in Bundt pan.",
        "Cover and let rise in turned-off oven until puffy and risen, 50 to 70 minutes.",
        "Remove pan, heat oven to 350 degrees. Unwrap and bake 30 to 35 minutes until deep brown. Cool 5 minutes, turn out, cool 10 minutes.",
        "Whisk confectioners' sugar and milk for glaze. Drizzle over warm bread.",
        "To make without a mixer, mix flour and salt in a bowl. Add milk mixture, stir until shaggy. Knead on floured surface for 10 minutes until smooth. Proceed as directed."
    ]
}