{
  "title": "Patatas Bravas",
  "rating": 4.5,
  "reviews": 79,
  "categories": [
    "Side Dishes",
    "Spanish & Portuguese",
    "Europe",
    "Potatoes",
    "Fruits & Vegetables",
    "Make Ahead"
  ],
  "author": "Annie Petito",
  "source": "Cook's Illustrated May/June 2016",
  "servings": "4 to 6",
  "image_url": "https://mrb-recipe-images-dev.s3.amazonaws.com/default.png",
  "time": "1½ hours, plus 20 minutes cooling",
  "ingredients": {
    "sauce": [
      "1 tablespoon vegetable oil",
      "2 teaspoons garlic, minced to paste",
      "1 teaspoon sweet smoked paprika",
      "½ teaspoon kosher salt",
      "½ - ¾ teaspoon cayenne pepper",
      "¼ cup tomato paste",
      "½ cup water",
      "2 teaspoons sherry vinegar",
      "¼ cup mayonnaise"
    ],
    "potatoes": [
      "2 ¼ pounds russet potatoes, peeled and cut into 1-inch pieces",
      "½ teaspoon baking soda",
      "Kosher salt",
      "3 cups vegetable oil"
    ]
  },
  "instructions": [
    "Heat oil in small saucepan over medium-low heat until shimmering. Add garlic, paprika, salt, and cayenne and cook until fragrant, about 30 seconds.",
    "Add tomato paste and cook for 30 seconds. Whisk in water and bring to boil over high heat. Reduce heat to medium-low and simmer until slightly thickened, 4 to 5 minutes.",
    "Transfer sauce to bowl, stir in vinegar, and let cool completely. Once cool, whisk in mayonnaise.",
    "Bring 8 cups water to boil in large saucepan over high heat. Add potatoes and baking soda. Return to boil and cook for 1 minute. Drain potatoes.",
    "Return potatoes to saucepan and place over low heat. Cook, shaking saucepan occasionally, until any surface moisture has evaporated, 30 seconds to 1 minute.",
    "Remove from heat. Add 1 1/2 teaspoons salt and stir with rubber spatula until potatoes are coated with thick, starchy paste, about 30 seconds.",
    "Transfer potatoes to rimmed baking sheet in single layer to cool.",
    "Heat oil in large Dutch oven over high heat to 375 degrees. Add all potatoes and cook, stirring occasionally, until deep golden brown and crispy, 20 to 25 minutes.",
    "Transfer potatoes to paper towel–lined wire rack set in rimmed baking sheet. Season with salt to taste.",
    "Spoon 1/2 cup sauce onto bottom of large platter or 1 1/2 tablespoons sauce onto individual plates. Arrange potatoes over sauce and serve immediately, passing remaining sauce separately."
  ]
}