{
  "title": "Shrimp Mozambique",
  "author": "Matthew Fairman",
  "source": "Cook's Country December/January 2019",
  "yield": "Serves 4",
  "time": "50 minutes",
  "categories": [
    "Main Courses",
    "Fish & Seafood"
  ],
  "description": "Shrimp Mozambique is a bracing dish of shrimp bathed in a buttery, garlicky, peppery sauce (think spicy shrimp scampi) with roots in Portugal's history in southeast Africa. Our version uses Frank's RedHot as a substitute for the traditional piri-piri pepper.",
  "ingredients": {
    "Sauce": [
      "2 tablespoons Frank's RedHot Original Cayenne Pepper Sauce",
      "2 tablespoons extra-virgin olive oil",
      "2 tablespoons water",
      "1/4 slice hearty white sandwich bread, torn into small pieces",
      "1 tablespoon chopped fresh parsley",
      "2 garlic cloves, chopped",
      "2 teaspoons paprika",
      "1/2 teaspoon pepper"
    ],
    "Shrimp": [
      "2 pounds extra-large shrimp (21 to 25 per pound), peeled, deveined, and tails removed",
      "Salt and pepper",
      "1 tablespoon extra-virgin olive oil",
      "1/2 cup finely chopped onion",
      "3 garlic cloves, sliced thin",
      "1 cup dry white wine",
      "2 tablespoons unsalted butter, cut into 2 pieces",
      "2 tablespoons chopped fresh parsley"
    ]
  },
  "instructions": [
    "FOR THE SAUCE: Process all sauce ingredients in a blender until smooth, about 2 minutes, scraping down sides as needed.",
    "FOR THE SHRIMP: Sprinkle shrimp with 1/2 teaspoon salt and 1/4 teaspoon pepper; set aside.",
    "Heat oil in a 12-inch nonstick skillet over medium heat until shimmering. Add onion and 1/2 teaspoon salt and cook until softened, about 5 minutes.",
    "Add garlic and cook until fragrant, about 1 minute. Add wine and bring to a boil. Cook until reduced by half, about 4 minutes.",
    "Add shrimp and cook, stirring occasionally, until opaque and just cooked through, about 4 minutes.",
    "Stir in butter and sauce and cook until butter is melted and sauce is heated through, about 1 minute.",
    "Season with salt and pepper to taste. Sprinkle with parsley and serve."
  ],
  "notes": "We prefer untreated shrimp without added sodium or preservatives. Frank's RedHot Original is a stand-in for traditional piri-piri sauce. Serve with crusty bread or over white rice."
}